
'''
企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，
高于10万元的部分，可可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
'''

# def fun(i):
#
#     if i <= 100000:
#         bonus = i*0.1
#     elif 100000 < i <= 200000:
#         bonus = 100000*0.1+(i-100000)*0.075
#     elif 200000 < i <= 400000:
#         bonus = 100000 * 0.1 + 100000*0.075+(i - 200000) * 0.05
#     elif 400000 < i <= 600000:
#         bonus = 100000 * 0.1 + 100000*0.075+200000 * 0.05+(i-400000)*0.03
#     elif 600000 < i <= 1000000:
#         bonus = 100000 * 0.1 + 100000*0.075+200000 * 0.05+400000*0.03+(i-600000)*0.015
#     elif 1000000<i:
#         bonus = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 400000 * 0.03 + 600000* 0.015+(i-1000000)*0.01
#     return bonus
#
# print(fun(110000))
i=int(input("请输入你的净利润(万元）:"))
a=[100,60,40,20,10,0]
b=[0.01,0.015,0.03,0.05,0.075,0.1]
r=0
for c in range(0,6):
    if i > a[c]:
        r+=(i-a[c])*b[c]
        d=c+1
        print("区间提成",(i-a[c])*b[c])
        i=a[c]
print("您的奖金提成为：{0}万元",format(r))


